docs/benchmark/results/apisix/ramp-up_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/joey/api-gateway/lumen-gateway/docs/benchmark/k6/ramp-up.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m20s max duration (incl. graceful stop):
              * ramp: Up to 500 looping VUs for 50s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 013/500 VUs, 4264 complete and 0 interrupted iterations
ramp   [   2% ] 013/500 VUs  00.9s/50.0s

running (0m01.9s), 017/500 VUs, 9008 complete and 0 interrupted iterations
ramp   [   4% ] 017/500 VUs  01.9s/50.0s

running (0m02.9s), 021/500 VUs, 16055 complete and 0 interrupted iterations
ramp   [   6% ] 021/500 VUs  02.9s/50.0s

running (0m03.9s), 025/500 VUs, 23823 complete and 0 interrupted iterations
ramp   [   8% ] 025/500 VUs  03.9s/50.0s

running (0m04.9s), 029/500 VUs, 31589 complete and 0 interrupted iterations
ramp   [  10% ] 029/500 VUs  04.9s/50.0s

running (0m05.9s), 033/500 VUs, 38250 complete and 0 interrupted iterations
ramp   [  12% ] 033/500 VUs  05.9s/50.0s

running (0m06.9s), 037/500 VUs, 45822 complete and 0 interrupted iterations
ramp   [  14% ] 037/500 VUs  06.9s/50.0s

running (0m07.9s), 041/500 VUs, 52522 complete and 0 interrupted iterations
ramp   [  16% ] 041/500 VUs  07.9s/50.0s

running (0m08.9s), 045/500 VUs, 61228 complete and 0 interrupted iterations
ramp   [  18% ] 045/500 VUs  08.9s/50.0s

running (0m09.9s), 049/500 VUs, 70602 complete and 0 interrupted iterations
ramp   [  20% ] 049/500 VUs  09.9s/50.0s

running (0m10.9s), 054/500 VUs, 79461 complete and 0 interrupted iterations
ramp   [  22% ] 054/500 VUs  10.9s/50.0s

running (0m11.9s), 059/500 VUs, 88694 complete and 0 interrupted iterations
ramp   [  24% ] 059/500 VUs  11.9s/50.0s

running (0m12.9s), 064/500 VUs, 98443 complete and 0 interrupted iterations
ramp   [  26% ] 064/500 VUs  12.9s/50.0s

running (0m13.9s), 069/500 VUs, 107396 complete and 0 interrupted iterations
ramp   [  28% ] 069/500 VUs  13.9s/50.0s

running (0m14.9s), 074/500 VUs, 116867 complete and 0 interrupted iterations
ramp   [  30% ] 074/500 VUs  14.9s/50.0s

running (0m15.9s), 079/500 VUs, 125888 complete and 0 interrupted iterations
ramp   [  32% ] 079/500 VUs  15.9s/50.0s

running (0m16.9s), 084/500 VUs, 135701 complete and 0 interrupted iterations
ramp   [  34% ] 084/500 VUs  16.9s/50.0s

running (0m17.9s), 089/500 VUs, 146430 complete and 0 interrupted iterations
ramp   [  36% ] 089/500 VUs  17.9s/50.0s

running (0m18.9s), 094/500 VUs, 156747 complete and 0 interrupted iterations
ramp   [  38% ] 094/500 VUs  18.9s/50.0s

running (0m19.9s), 099/500 VUs, 166861 complete and 0 interrupted iterations
ramp   [  40% ] 099/500 VUs  19.9s/50.0s

running (0m20.9s), 109/500 VUs, 176708 complete and 0 interrupted iterations
ramp   [  42% ] 109/500 VUs  20.9s/50.0s

running (0m21.9s), 119/500 VUs, 187208 complete and 0 interrupted iterations
ramp   [  44% ] 119/500 VUs  21.9s/50.0s

running (0m22.9s), 129/500 VUs, 197996 complete and 0 interrupted iterations
ramp   [  46% ] 129/500 VUs  22.9s/50.0s

running (0m23.9s), 139/500 VUs, 207897 complete and 0 interrupted iterations
ramp   [  48% ] 139/500 VUs  23.9s/50.0s

running (0m24.9s), 149/500 VUs, 219119 complete and 0 interrupted iterations
ramp   [  50% ] 149/500 VUs  24.9s/50.0s

running (0m25.9s), 159/500 VUs, 229327 complete and 0 interrupted iterations
ramp   [  52% ] 159/500 VUs  25.9s/50.0s

running (0m26.9s), 169/500 VUs, 238392 complete and 0 interrupted iterations
ramp   [  54% ] 169/500 VUs  26.9s/50.0s

running (0m27.9s), 179/500 VUs, 249564 complete and 0 interrupted iterations
ramp   [  56% ] 179/500 VUs  27.9s/50.0s

running (0m28.9s), 189/500 VUs, 260000 complete and 0 interrupted iterations
ramp   [  58% ] 189/500 VUs  28.9s/50.0s

running (0m29.9s), 199/500 VUs, 270923 complete and 0 interrupted iterations
ramp   [  60% ] 199/500 VUs  29.9s/50.0s

running (0m30.9s), 209/500 VUs, 279643 complete and 0 interrupted iterations
ramp   [  62% ] 209/500 VUs  30.9s/50.0s

running (0m31.9s), 219/500 VUs, 290964 complete and 0 interrupted iterations
ramp   [  64% ] 219/500 VUs  31.9s/50.0s

running (0m32.9s), 229/500 VUs, 301488 complete and 0 interrupted iterations
ramp   [  66% ] 229/500 VUs  32.9s/50.0s

running (0m33.9s), 239/500 VUs, 311766 complete and 0 interrupted iterations
ramp   [  68% ] 239/500 VUs  33.9s/50.0s

running (0m34.9s), 249/500 VUs, 323150 complete and 0 interrupted iterations
ramp   [  70% ] 249/500 VUs  34.9s/50.0s

running (0m35.9s), 259/500 VUs, 334417 complete and 0 interrupted iterations
ramp   [  72% ] 259/500 VUs  35.9s/50.0s

running (0m36.9s), 269/500 VUs, 344273 complete and 0 interrupted iterations
ramp   [  74% ] 269/500 VUs  36.9s/50.0s

running (0m37.9s), 279/500 VUs, 353440 complete and 0 interrupted iterations
ramp   [  76% ] 279/500 VUs  37.9s/50.0s

running (0m38.9s), 289/500 VUs, 364059 complete and 0 interrupted iterations
ramp   [  78% ] 289/500 VUs  38.9s/50.0s

running (0m39.9s), 299/500 VUs, 375126 complete and 0 interrupted iterations
ramp   [  80% ] 299/500 VUs  39.9s/50.0s

running (0m40.9s), 318/500 VUs, 385929 complete and 0 interrupted iterations
ramp   [  82% ] 318/500 VUs  40.9s/50.0s

running (0m41.9s), 338/500 VUs, 396713 complete and 0 interrupted iterations
ramp   [  84% ] 338/500 VUs  41.9s/50.0s

running (0m42.9s), 358/500 VUs, 407844 complete and 0 interrupted iterations
ramp   [  86% ] 358/500 VUs  42.9s/50.0s

running (0m44.0s), 379/500 VUs, 416123 complete and 0 interrupted iterations
ramp   [  88% ] 379/500 VUs  44.0s/50.0s

running (0m44.9s), 398/500 VUs, 426188 complete and 0 interrupted iterations
ramp   [  90% ] 398/500 VUs  44.9s/50.0s

running (0m45.9s), 418/500 VUs, 437706 complete and 0 interrupted iterations
ramp   [  92% ] 418/500 VUs  45.9s/50.0s

running (0m46.9s), 438/500 VUs, 448630 complete and 0 interrupted iterations
ramp   [  94% ] 438/500 VUs  46.9s/50.0s

running (0m47.9s), 458/500 VUs, 459687 complete and 0 interrupted iterations
ramp   [  96% ] 458/500 VUs  47.9s/50.0s

running (0m48.9s), 478/500 VUs, 471060 complete and 0 interrupted iterations
ramp   [  98% ] 478/500 VUs  48.9s/50.0s

running (0m49.9s), 498/500 VUs, 482262 complete and 0 interrupted iterations
ramp   [ 100% ] 498/500 VUs  49.9s/50.0s


  █ TOTAL RESULTS 

    checks_total.......: 966778  19324.870255/s
    checks_succeeded...: 100.00% 966778 out of 966778
    checks_failed......: 0.00%   0 out of 966778

    ✓ status is 200
    ✓ body is not empty

    HTTP
    http_req_duration..............: avg=18.6ms  min=410µs    max=430.41ms p(50)=12.8ms  p(75)=24.68ms p(95)=53.38ms p(99)=86.87ms count=483389
      { expected_response:true }...: avg=18.6ms  min=410µs    max=430.41ms p(50)=12.8ms  p(75)=24.68ms p(95)=53.38ms p(99)=86.87ms count=483389
    http_req_failed................: 0.00%  0 out of 483389
    http_reqs......................: 483389 9662.435127/s

    EXECUTION
    iteration_duration.............: avg=18.67ms min=440.95µs max=430.45ms p(50)=12.87ms p(75)=24.76ms p(95)=53.45ms p(99)=86.94ms count=483389
    iterations.....................: 483389 9662.435127/s
    vus............................: 498    min=13          max=498
    vus_max........................: 500    min=500         max=500

    NETWORK
    data_received..................: 472 MB 9.4 MB/s
    data_sent......................: 156 MB 3.1 MB/s



running (0m50.0s), 000/500 VUs, 483389 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 000/500 VUs  50s